let app = getApp();

Page({
  data: {
    messages: [
      {
        title: "我一直空课表或课表报错，怎么办?",
        content:
          "<p>1. 首先检查一下网络连接（废话</p>" +
          "<p>2. 假如是空课表，无报错，请检查一下当前学期是否正确</p>" +
          "<p>3. 切换学期:右下角『期/周』切换，然后点击下方箭头进行切换学期</p>" +
          "<p>4. 假如是报错，请前往『我的-设置-绑定正方』重新填写正方密码进行绑定操作</p>" +
          "<p>5. 然后回到首页下拉刷新</p>",
      },
      {
        title: '遇到了"用户名或密码错误"',
        content:
          '<p>请去“我的"-"设置"–"绑定正方密码”，重新绑定正方的密码,最近正方老是出错，请各位用户勤截图,特别是排考</p>',
      },
      {
        title: '遇到"请先绑定原创账号"的提示',
        content:
          "<p>有些非17级学生可能会遇到“请先绑定原创账号”的提示，或者出现查不到课表或成绩或排考的情况，请去“我的”–“设置”-“绑定原创账号”里绑定你的原创账号。</p>" +
          "<p>出现这个原因是因为你们不小心将学期切换到了上学期，上学期使用的是原创教务系统，所以需要先绑定原创账号才能查询</p>",
      },
      {
        title: '遇到"正方服务器出错"请怼教务处',
        content:
          "<p>教务处:</p>" +
          "<p>选课:85290019</p>" +
          "<p>资源管理(教室借用):85290020</p>" +
          "<p>教务管理(重考、重修、学生证补办、订火车票、申请旁听课):85290029</p>",
      },
      {
        title: "正方教务系统的密码是什么?",
        content:
          "<p>这个密码到底是什么?当然是你们自己的教务系统账号的密码啦选课调课查成绩用的都是正方教务系统这个密码你来问我我也只能告诉你初始密码是身份证号后六位</p>" +
          "<p>至于你现在的密码是什么我也不知道总不能要我来帮你操作吧</p>" +
          "<p>当然啦，要是忘记了自己的教务系统密码可以去学院教务处重置哦～</p>",
      },
    ],
    flag: [0, 0, 0, 0, 0],
  },
  onLoad() {},
  onUnload() {
    this.disconnect();
  },

  toggleShowDetail: function (e) {
    var f = 0;
    const index = e.currentTarget.dataset.index;
    if (this.data.flag[index] === 0) {
      f = 1;
    }
    this.data.flag[index] = f;
    const flag = this.data.flag;
    this.setData({
      flag,
    });
  },
});
