Page({
  data: {
    messages: [
      {
        id: "1",
        title: "我一直空课表或课表报错，怎么办？",
        content:
          "<p>1. 首先检查一下网络连接</p>" +
          "<p>2. 假如是空课表，没有报错，请检查一下当前学期是否正确</p>" +
          "<p>3. 切换学期：右下角「期/周」切换，然后点击下方箭头进行切换学期</p>" +
          "<p>4. 假如有报错，请前往「我的-设置-绑定正方」重新填写正方密码进行绑定操作</p>" +
          "<p>5. 然后回到首页下拉刷新</p>",
      },
      {
        id: "2",
        title: "遇到了「用户名或密码错误」",
        content:
          "<p>请去「我的」-「设置」–「绑定正方密码」，重新绑定正方教务系统密码,最近正方老是出错，请各位用户勤截图，特别是排考</p>",
      },
      // {
      //   id: "3",
      //   title: '遇到"请先绑定原创账号"的提示',
      //   content:
      //     "<p>有些非17级学生可能会遇到“请先绑定原创账号”的提示，或者出现查不到课表或成绩或排考的情况，请去“我的”–“设置”-“绑定原创账号”里绑定你的原创账号。</p>" +
      //     "<p>出现这个原因是因为你们不小心将学期切换到了上学期，上学期使用的是原创教务系统，所以需要先绑定原创账号才能查询</p>",
      // },
      {
        id: "3",
        title: "关于半夜被刷卡/非自己刷卡等校园卡问题",
        content:
          "<img src='https://assets.gettoset.cn/wejh/qna-card.jpg' style='max-width:100%; height:auto'></img>",
      },
      {
        id: "4",
        title: "遇到「正方服务器出错」请怼教务处",
        content:
          "<b>教务处</b>" +
          "<p>选课：5290019</p>" +
          "<p>资源管理（教室借用）：85290020</p>" +
          "<p>教务管理（重考、重修、学生证补办、订火车票、申请旁听课）：85290029</p>",
      },
      {
        id: "5",
        title: "正方教务系统的密码是什么？",
        content:
          "<p>这个密码到底是什么？当然是你们自己的教务系统账号的密码啦～</p>" +
          "<p>选课调课查成绩用的都是正方教务系统这个密码，你来问我我也只能告诉你初始密码是身份证号后六位</p>" +
          "<p>至于你现在的密码是什么我也不知道总不能要我来帮你操作吧</p>" +
          "<p>当然啦，要是忘记了自己的教务系统密码可以去学院教务处重置哦～</p>",
      },
      {
        id: "6",
        title: "问题紧急请添加反馈 QQ 群",
        content: "<p>462530805（一群）</p>" + "<p>282402782（二群）</p>",
      },
    ],
    disclosure: {},
  },
  toggleShowDetail(event) {
    const { index } = event.currentTarget.dataset;
    const disclosure = this.data.disclosure;
    this.setData({
      disclosure: { ...disclosure, [index]: !disclosure[index] },
    });
  },
});
